---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarBendingDetailType
source: html/9e6af0fc-1c7a-47e2-d6fd-460a36d6bc89.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType

Type for rebar bending detail elements.

## Syntax (C#)
```csharp
public class RebarBendingDetailType : ElementType
```